/*
*******************************************************************************************************
*
* 文件名称 : rtc.h
* 版    本 : V1.0
* 作    者 : OpenRabbit
* 说    明 : RTC驱动文件
* 
*******************************************************************************************************
*/

#ifndef _RTC_H
#define _RTC_H


/* 头文件 -----------------------------------------------------------*/
#include "bsp.h"

/* 宏定义 -----------------------------------------------------------*/



/* 全局变量 ----------------------------------------------------------*/


/* 函数声明 ----------------------------------------------------------*/

void rtc_init(void);
void rtc_set_time(uint8_t hour,uint8_t minute,uint8_t second);
void rtc_set_date(uint8_t year,uint8_t month,uint8_t date,uint8_t week);
void rtc_current(RTC_DateTypeDef *date,RTC_TimeTypeDef *time);



#endif

/***************************** 跳兔科技 www.whtiaotu.com (END OF FILE) *********************************/
